In [18]:
# Chapter 6: Data Loading, Storage, and File Formats

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [26]:
df = pd.read_csv("examples/ex1.csv")

In [28]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [32]:
pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
names = ["a", "b", "c", "d", "message"]

In [48]:
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [54]:
# The command !cat is a Unix command, so it needs to be replaced with the Windows system command !type, 
# and the forward slash / should be changed to a backslash \.
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [56]:
# The term parsing is also sometimes used to describe loading text data 
# and interpreting it as tables and different data types.
parsed = pd.read_csv("examples/csv_mindex.csv",
                     index_col=["key1", "key2"])

In [58]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [60]:
!type examples\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [70]:
result = pd.read_csv("examples/ex3.txt", sep="\\s+")

In [72]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [74]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [76]:
pd.read_csv("examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [78]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [80]:
result = pd.read_csv("examples/ex5.csv")

In [82]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [84]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [86]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [88]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [90]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [92]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [94]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [96]:
result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False,
                      na_values=["NA"])

In [98]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [100]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [102]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [104]:
pd.read_csv("examples/ex5.csv", na_values=sentinels,
            keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [8]:
pd.options.display.max_rows = 10

In [10]:
result = pd.read_csv("examples/ex6.csv")

In [12]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [14]:
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [40]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [42]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [44]:
totals = pd.Series([], dtype='int64') # an empty Series of type int64.

In [46]:
for piece in chunker:
    totals = totals.add(piece["key"].value_counts(), fill_value=0)

In [48]:
totals = totals.sort_values(ascending=False)

In [50]:
totals[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [52]:
data = pd.read_csv("examples/ex5.csv")

In [54]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [56]:
data.to_csv("examples/out.csv")

In [58]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [7]:
import sys

In [64]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [66]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [68]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [72]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [74]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [9]:
import csv

In [35]:
f = open("examples/ex7.csv")

In [13]:
reader = csv.reader(f)

In [15]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [17]:
f.close()

In [19]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [21]:
header, values = lines[0], lines[1:]

In [23]:
lines[0]

['a', 'b', 'c']

In [25]:
lines[1:]

[['1', '2', '3'], ['1', '2', '3']]

In [27]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [29]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [37]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [39]:
reader = csv.reader(f, dialect=my_dialect)

In [41]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [61]:
reader = csv.reader(f, delimiter="|")

In [65]:
for line in reader:
    print(line)

In [67]:
f.close

In [69]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [73]:
f = open("mydata.csv")

In [75]:
reader = csv.reader(f)

In [77]:
for line in reader:
    print(line)

['one;two;three']
['1;2;3']
['4;5;6']
['7;8;9']

In [79]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [81]:
import json

In [83]:
result = json.loads(obj)

In [85]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [89]:
asjson = json.dumps(result)

In [91]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [93]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [95]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [99]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [101]:
data = pd.read_json("examples/example.json")

In [103]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [105]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [109]:
# The orient parameter controls the structure of the JSON data. 
# The records option converts each row of data into a JSON object, and then these objects are placed into a list.
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [111]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [113]:
len(tables)

1

In [115]:
failures = tables[0]

In [117]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [119]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [121]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [123]:
from lxml import objectify

In [125]:
path = "datasets/mta_perf/Performance_MNR.xml"

In [127]:
with open(path) as f:
    parsed = objectify.parse(f)

In [129]:
root = parsed.getroot()

In [131]:
data = []

skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [133]:
perf = pd.DataFrame(data)

In [135]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [137]:
perf2 = pd.read_xml(path)

In [139]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [7]:
frame = pd.read_csv("examples/ex1.csv")

In [9]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
frame.to_pickle("examples/frame_pickle")

In [13]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
fec = pd.read_parquet('datasets/fec/fec.parquet')

In [17]:
fec

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250.0,20-JUN-11,None,None,None,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50.0,23-JUN-11,None,None,None,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,05-JUL-11,None,None,None,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250.0,01-AUG-11,None,None,None,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300.0,20-JUN-11,None,None,None,SA17A,736166
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1001726,C00500587,P20003281,"Perry, Rick","GORMAN, CHRIS D. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,5000.0,29-SEP-11,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,None,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,SA17A,751678
1001727,C00500587,P20003281,"Perry, Rick","DUFFY, DAVID A. MR.",INFO REQUESTED,XX,99999,DUFFY EQUIPMENT COMPANY INC.,BUSINESS OWNER,2500.0,30-SEP-11,None,None,None,SA17A,751678
1001728,C00500587,P20003281,"Perry, Rick","GRANE, BRYAN F. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,29-SEP-11,None,None,None,SA17A,751678
1001729,C00500587,P20003281,"Perry, Rick","TOLBERT, DARYL MR.",INFO REQUESTED,XX,99999,T.A.C.C.,LONGWALL MAINTENANCE FOREMAN,500.0,30-SEP-11,None,None,None,SA17A,751678
1001730,C00500587,P20003281,"Perry, Rick","ANDERSON, MARILEE MRS.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,31-AUG-11,None,None,None,SA17A,751678

In [21]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [23]:
xlsx.sheet_names

['Sheet1']

In [25]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [27]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [31]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [33]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [35]:
frame.to_excel(writer, "Sheet1")

D:\TEMP\ipykernel_1532\2112036528.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, "Sheet1")

In [39]:
writer._save()

In [41]:
xlsx2 = pd.ExcelFile("examples/ex2.xlsx")

In [45]:
xlsx2.sheet_names

['Sheet1']

In [49]:
xlsx2.parse(sheet_name="Sheet1")

   Unnamed: 0.1  Unnamed: 0  a   b   c   d message
0             0           0  1   2   3   4   hello
1             1           1  5   6   7   8   world
2             2           2  9  10  11  12     foo

In [51]:
frame.to_excel("examples/ex2.xlsx")

In [53]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [55]:
store = pd.HDFStore("examples/mydata.h5")

In [61]:
store["obj1"] = frame

In [63]:
store["obj1_col"] = frame["a"]

In [65]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [67]:
store["obj1"]

           a
0  -0.929313
1  -0.726343
2  -0.345936
3   0.630098
4   1.390995
..       ...
95 -0.864662
96 -1.503287
97 -1.073498
98 -0.486139
99 -0.148595

[100 rows x 1 columns]

In [69]:
store.put("obj2", frame, format="table")

In [71]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10 -0.601765
11 -0.056130
12 -2.290799
13 -0.043595
14  0.468359
15 -0.201891

In [73]:
store.close()

In [75]:
frame.to_hdf("examples/mydata.h5", "obj3", format="table")

D:\TEMP\ipykernel_1532\1151319590.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf("examples/mydata.h5", "obj3", format="table")

In [77]:
pd.read_hdf("examples/mydata.h5", "obj3", where=["index < 5"])

          a
0 -0.929313
1 -0.726343
2 -0.345936
3  0.630098
4  1.390995

In [79]:
import os

In [81]:
os.remove("examples/mydata.h5")

In [83]:
import requests

In [85]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [87]:
resp = requests.get(url)

In [89]:
resp.raise_for_status()

In [91]:
resp

In [93]:
data = resp.json()

In [95]:
data[0]["title"]

'TST (string dtype): fix and clean up arrow roundtrip tests'

In [97]:
issues = pd.DataFrame(data, columns=["number", "title",
                                     "labels", "state"])

In [99]:
issues

,number,title,labels,state
0,59678,TST (string dtype): fix and clean up arrow rou...,"[{'id': 57522093, 'node_id': 'MDU6TGFiZWw1NzUy...",open
1,59672,REF: Use numpy methods instead of np.array,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
2,59671,DOC: Clarify existence Series.dt.to_timestamp,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
3,59670,DOC: Document that DataFrame.from_records()'s ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,59667,BUG: `df.groupby().aggregate()` doesn't preser...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
5,59666,BUG: rolling with method='table' and apply sor...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
6,59664,RLS: 2.3,"[{'id': 131473665, 'node_id': 'MDU6TGFiZWwxMzE...",open
7,59659,ENH: increase verbosity on error,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
8,59657,PERF: Melt 2x slower when future.infer_string ...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
9,59656,BUG: arithmetic between datetime.timedelta sca...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
10,59655,DOCS: fix docstring validation error for panda...,[],open
11,59654,expose `to_pandas_kwargs` in `read_parquet` wi...,[],open
12,59653,BUG: some cases of binary arithmetic between s...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,59652,BUG: Pearson correlation outside expected rang...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,59650,BUG: diff method incorrect on datetime64[s],"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
15,59649,increase verbosity,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
16,59647,PERF: CategoricalDtype.update_dtype,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
17,59646,BUG: Retain index when merging on an index,[],open
18,59636,Fix binary operations on attrs for Series and ...,[],open
19,59631,ENH: support the Arrow PyCapsule Interface for...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
20,59629,BUG: Fix inconsistent pivot table subaggregati...,[],open
21,59627,BUG(?): Allow setitem to category/sparse of th...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,59624,API: str.center with pyarrow-backed string dtype,"[{'id': 57522093, 'node_id': 'MDU6TGFiZWw1NzUy...",open
23,59623,BUG: style.map() not compatible with CSS strin...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,59620,"BUG: Resampling to ""B"" frequency with closed=""...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,59616,String dtype: propagate NaNs as False in predi...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
26,59614,BUG: `numpy.ma.fix_invalid` makes changes in-p...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,59609,BUG: isin check with numpy array works incorre...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,59601,Fix/group by agg pyarrow bool numpy same type,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,59595,DOCS: fix docstring validation errors for pand...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open

In [101]:
import sqlite3

In [105]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [109]:
con = sqlite3.connect("mydata.sqlite")

In [111]:
con.execute(query)

In [113]:
con.commit()

In [115]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)]

In [117]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [119]:
con.executemany(stmt, data)

In [121]:
con.commit()

In [123]:
cursor = con.execute("SELECT * FROM test")

In [125]:
rows = cursor.fetchall()

In [127]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [131]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [133]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [135]:
import sqlalchemy as sqla

In [137]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [139]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5